БИТУправление_медицинским_центром_демо/src/Documents/КорректировкаДолгаКлиента/КорректировкаДолгаКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолгаКлиента</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКлиентами</registerRecords>
  <attributes>
    <name>КлиентПриемник</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентИсточник</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКорректировкиДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СделкаПриемник</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>СделкаИсточник</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ВзаиморасчетыСКлиентами/ВзаиморасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийКорректировкиДолга/ВидыОперацийКорректировкиДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКорректировкиДолга</name>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Передача</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/КорректировкаДолгаКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка заполнения
	ТекстШаблонОшибкиНачало = НСтр("ru='В качестве расчета'");
	ТекстШаблонОшибкиПродолжение = НСтр("ru='указан документ с видом, по которому не используется обособленный учет взаиморасчетов!'");
	ШаблонОшибкиСделка = ТекстШаблонОшибкиНачало + "-%тип% " + ТекстШаблонОшибкиПродолжение;
	Если ЗначениеЗаполнено(СделкаПриемник)
		И Не КомплексныеРасчетыКлиентов.РасчетСОбособленнымУчетомВзаиморасчетов(СделкаПриемник)
	Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрЗаменить(ШаблонОшибкиСделка,"%тип%", НСтр("ru='приемника'")), Отказ);
	КонецЕсли;
	Если ЗначениеЗаполнено(СделкаИсточник)
		И Не КомплексныеРасчетыКлиентов.РасчетСОбособленнымУчетомВзаиморасчетов(СделкаИсточник)
	Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрЗаменить(ШаблонОшибкиСделка,"%тип%", НСтр("ru='источника'")), Отказ);
	КонецЕсли;
	
	// Формирование движений
	ВидДвиженияПриемник = ?(Сумма <= 0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	ВидДвиженияИсточник = ?(Сумма <= 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	СуммаОперации = Макс(Сумма, -Сумма);

	Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
	Движение.ВидДвижения	= ВидДвиженияПриемник;
	Движение.Период			= Дата;
	Движение.Клиент			= КлиентПриемник;
	Движение.Сделка			= СделкаПриемник;
	Движение.Сумма			= СуммаОперации;

	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкиДолга.Передача Тогда 
		Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Движение.ВидДвижения	= ВидДвиженияИсточник;
		Движение.Период			= Дата;
		Движение.Клиент			= КлиентИсточник;
		Движение.Сделка			= СделкаИсточник;
		Движение.Сумма			= СуммаОперации;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если (ВидОперации = Перечисления.ВидыОперацийКорректировкиДолга.Корректировка)
		И ЗначениеЗаполнено(КлиентИсточник)
	Тогда
		КлиентИсточник = Справочники.Клиенты.ПустаяСсылка()
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ВидОперации = Перечисления.ВидыОперацийКорректировкиДолга.Передача Тогда
		ПроверяемыеРеквизиты.Добавить("КлиентИсточник");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
